#### ElementIdParameterValue Members

---

|  |
| --- |
| ElementIdParameterValue Class   Constructors   Methods   Properties   See Also |

The  ElementIdParameterValue  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementIdParameterValue | Default constructor |
| Public method | ElementIdParameterValue(ElementId) | Value constructor |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Copy | Makes an identical copy of the given parameter value. (Inherited from  ParameterValue  .) |
| Public method | Dispose | (Inherited from  ParameterValue  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsEqual | Tests equality with another instance of the same class. (Inherited from  ParameterValue  .) |
| Public method | IsSameType | Tests another instance is of the same value type. (Inherited from  ParameterValue  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ParameterValue  .) |
| Public property | Value | The stored value |

# See Also

ElementIdParameterValue Class

Autodesk.Revit.DB Namespace